# Напишите template строки, который можно будет многократно переиспользовать,
# вставляя в него имя и фамилию человека. Используйте метод строки "format".

first_name = 'Anton'
second_name = 'Chornii'

print('Hello, my name is {first_name} {second_name}'.format(first_name=first_name, second_name=second_name))
print(f'Hello, my name is {first_name} {second_name}')
